Revit 2024 API
Hardwood.HardwoodApplication Property
 The property labeled "Used For" from the "Hardwood" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static string HardwoodApplication { get; }
Visual Basic
Public Shared ReadOnly Property HardwoodApplication As String
	Get
Visual C++
public:
static property String^ HardwoodApplication {
	String^ get ();
}
Remarks
 This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "HardwoodApplicationType".
See Also
Hardwood Class
Autodesk.Revit.DB.Visual Namespace